# Exercises I

# Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

# cd into your exercises folder for this module and run echo env.py >> .gitignore

# Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [1]:
# get a url from a user, password, host and database
user = "neo"
password = "follow_the_white_rabbit"
host = "matrix_incubation_pod_11379"
database = "the_one"

url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
url

'mysql+pymysql://neo:follow_the_white_rabbit@matrix_incubation_pod_11379/the_one'

In [2]:
# convert code into a function
def get_db_url(user,password,host,database):
    '''get a url from input user, password, host and database'''
    
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'

In [3]:
# testing the function
user = "neo"
password = "follow_the_white_rabbit"
host = "matrix_incubation_pod_11379"
database = "the_one"

get_db_url(user,password,host,database)

'mysql+pymysql://neo:follow_the_white_rabbit@matrix_incubation_pod_11379/the_one'

# Use your function to obtain a connection to the employees database.

In [4]:
import pandas as pd
from env import user, password, host

# enter query as a variable
query = "select * from employees"

# get url from function
url = get_db_url(user, password, host, 'employees')

# get dataframe from query and url using read_sql
pd.read_sql(query, url)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [5]:
# refactored get_db_url to return a dataframe based on inputs
def get_data_from_sql(user, host, password, database, query):
    '''
    take in user, host, password, 
    database and query
    Access sql database
    return a pandas dataframe of the query results   
    '''
    # get url from input 
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
        
    # return dataframe of query using read_sql
    return pd.read_sql(query, url)

In [6]:
# testing function

query = '''

select * from employees

'''

df = get_data_from_sql(user, host, password, "employees", query)

df.head(10)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

# Once you have successfully run a query:

# a. Intentionally make a typo in the database url. What kind of error message do you see?

In [27]:
# # making a typo in the user name results in an access denied message
# url = f'mysql+pymysql://{user}ERROR:{password}@{host}/employees'
        
# pd.read_sql(query, url)

# b. Intentionally make an error in your SQL query. What does the error message look like?

In [28]:
# # making an error in your sql syntax will result in a sql syntax error
# url = f'mysql+pymysql://{user}:{password}@{host}/employees'
    
# query = "select ** from employees"
        
# pd.read_sql(query, url)

# Read the employees and titles tables into two separate DataFrames.

In [7]:
# getting employees data from sql server using the get_data_from_sql
employees = get_data_from_sql(user, host, password, 'employees', 'select * from employees')
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [8]:
# getting titles data from sql server using the get_data_from_sql
titles = get_data_from_sql(user, host, password, 'employees', 'select * from titles')
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

# How many rows and columns do you have in each DataFrame? Is that what you expected?

In [9]:
employees.shape

(300024, 6)

In [10]:
titles.shape

(443308, 4)

# Display the summary statistics for each DataFrame.

In [11]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [12]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [13]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [14]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

# How many unique titles are in the titles DataFrame?

In [15]:
# get count of values in a column using value_counts
titles.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

In [16]:
# get number of unique values by getting length of value_counts of the column 
len(titles.title.value_counts())

7

# What is the oldest date in the to_date column?

In [17]:
# passing ascending = False will cause the values in value counts to sort in descending order
titles.to_date.sort_values(ascending=False)

0         9999-01-01
251516    9999-01-01
251529    9999-01-01
251528    9999-01-01
251526    9999-01-01
             ...
277603    1985-04-17
35527     1985-03-23
346216    1985-03-20
406358    1985-03-11
16064     1985-03-01
Name: to_date, Length: 443308, dtype: object

In [18]:
# using head one will show only the value at the top of the value sort
titles.to_date.sort_values(ascending=False).head(1)

0    9999-01-01
Name: to_date, dtype: object

# What is the most recent date in the to_date column?

In [24]:
# sort values in to_date in ascending order display the top value
titles.to_date.sort_values(ascending=True).head(1)

16064    1985-03-01
Name: to_date, dtype: object

# Exercises II

# Copy the users and roles DataFrames from the examples above.

In [29]:
import numpy as np

In [30]:
# create dataframe using dictionary
users = pd.DataFrame({
                        'id': [1, 2, 3, 4, 5, 6],
                        'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
                        'role_id': [1, 2, 3, 3, np.nan, np.nan]
                     })
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [31]:
# create dataframe using dictionary
roles = pd.DataFrame({
                        'id': [1, 2, 3, 4],
                        'name': ['admin', 'author', 'reviewer', 'commenter']
                    })
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

# What is the result of using a right join on the DataFrames?

In [32]:
# right merge users and roles using the role_id and id 
pd.merge(users, roles, left_on='role_id', right_on='id', how='right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

* If columns have matching names they are renamed adding _x or _y depending on which dataframe they came from
* All rows on the right dataframe are kept
* If a row on the left dataframe matches a row on the right dataframe they are combined into one row
* If a row on the left dataframe does not match a row on the right dataframe it is discarded 
* If a row on the right dataframe does not match a row on the left dataframe the row is added to the new dataframe and null values are placed in the columns from the right dataframe
* rows are matching if they contain the same value for the columns designated left_on and right_on

# What is the result of using an outer join on the DataFrames?

In [ ]:
# outer merging the users and roles tables on the role_id and id columns
pd.merge(users, roles, left_on='role_id', right_on='id', how='outer')

* If columns have matching names they are renamed adding _x or _y depending on which table they came from
* All rows are kept
* Rows that match are combined into one row 
* Rows that do not match are added to the new dataframe and nulls are put into columns where values are missing

# What happens if you drop the foreign keys from the DataFrames and try to merge them

* Foreign keys are a collumn or set of columns that allow us to establish a referential link between the data in two tables
* Without Foreign keys to link the dataframes together, merging them is impossible

# Load the mpg dataset from PyDataset.

In [ ]:
import pydataset
from pydataset import data

# save mpg data as mpg
mpg = data('mpg')

# Output and read the documentation for the mpg dataset.

In [ ]:
# read out documentation for mpg data
pydataset.data('mpg', show_doc=True)

# How many rows and columns are in the dataset?

In [ ]:
mpg.shape

# Check out your column names and perform any cleanup you may want on them.

In [ ]:
mpg.columns

In [ ]:
# rename columns using .rename
mpg = mpg.rename(columns={'cty':'cty_mpg', 'hwy':'hwy_mpg'})

mpg.head()

# Display the summary statistics for the dataset.

In [ ]:
mpg.info()

In [ ]:
mpg.describe()

# How many different manufacturers are there?

In [ ]:
mpg.manufacturer.value_counts()

In [ ]:
len(mpg.manufacturer.value_counts())

# How many different models are there?

In [ ]:
mpg.model.value_counts()

In [ ]:
len(mpg.model.value_counts())

# Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [ ]:
# get new column mileage_difference by subtracting cty_mpg from hwy_mpg
mpg['mileage_difference'] = mpg.hwy_mpg - mpg.cty_mpg

In [ ]:
mpg.head()

# Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [ ]:
# create new column average_mileage by summing hwy_mpg and cty_mpg, and dividing the result by two
mpg['average_mileage'] = (mpg.hwy_mpg + mpg.cty_mpg) / 2

In [ ]:
mpg.head()

# Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [ ]:
# inspect values in trans
mpg.trans.value_counts()

In [ ]:
# create new column is_automatic by checking weather the first character in each value in trans is 'a.' 
mpg['is_automatic'] = mpg.trans.apply(lambda value : value[0] == 'a')

In [ ]:
mpg.sample(10)

# Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [ ]:
# what do I want to compare
mpg.groupby('manufacturer')

In [ ]:
# what will I use to compare them 
mpg.groupby('manufacturer').average_mileage

In [ ]:
# how will I aggragate the data
mpg.groupby('manufacturer').average_mileage.agg('mean')

In [ ]:
# how will I aggragate the data
mpg.groupby('manufacturer').average_mileage.agg('median').sort_values()

In [ ]:
# what part of the data do I want to show
mpg.groupby('manufacturer').average_mileage.agg('mean').sort_values().tail(1)

In [ ]:
# group by manufacturer comparing the mean of average_milage, sort those values and display the last one 
mpg.groupby('manufacturer').average_mileage.agg('mean').sort_values().tail(1)

# Do automatic or manual cars have better miles per gallon?

In [ ]:
# what do I want to compare
mpg.groupby('is_automatic')

In [ ]:
# what will I use to compare them 
mpg.groupby('is_automatic').average_mileage

In [ ]:
# how will I aggragate the data
mpg.groupby('is_automatic').average_mileage.agg('mean')

In [ ]:
# group by is_automatic an
mpg.groupby('is_automatic').average_mileage.agg('mean')

# Exercises III

# Use your get_db_url function to help you explore the data from the chipotle database.

In [ ]:
# function from earlier
def get_data_from_sql(user, host, password, database, query):
    '''
    take in user, host, password, 
    database and query
    Access sql database
    return a pandas dataframe of the query results   
    '''
    
    # get url from function inputs
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    
    # get dataframe from query and url using read_sql 
    return pd.read_sql(query, url)

In [ ]:
# using function to get data from chipolte database  
df = get_data_from_sql(user, host, password, 'chipotle', 'select * from orders')
df.head()

# What is the total price for each order?

In [33]:
# group by order id 
df.groupby('order_id')

KeyError: 'order_id'

In [ ]:
# group by order id using item price to compare them
df.groupby('order_id').item_price

In [ ]:
# group by order id using the sum of item price to compare them
# Shows error if not cleaned properly
df.groupby('order_id').item_price.agg('sum')

In [ ]:
# applies lambda to values in item_price 
# lambda removes the first chatacter and leading and trailing white space in the string
# it then converts the value to a float

df['item_price'] = df.item_price.apply(lambda value: float(value[1:].strip()))

In [ ]:
df.head()

In [ ]:
df.info()

In [ ]:
df.head()

In [ ]:
# group by order_id using the sum of item price to compare the groups
df.groupby('order_id').item_price.agg('sum')

# What are the most popular 3 items?

In [ ]:
# group by item_name using the sum of quantity to compare the groups
# sorting in decending order and only showing the top three items
df.groupby('item_name').quantity.agg('sum').sort_values(ascending=False).head(3)

# Which item has produced the most revenue?

In [ ]:
# group by item_name using the sum of item_price to compare the groups
# sort values in decending order and displaying only the top  
df.groupby('item_name').item_price.agg('sum').sort_values(ascending=False).head(1)

# Using the titles DataFrame, visualize the number of employees with each title.

In [ ]:
# remove whitespace from beginning and end of strings in to_date column 
titles['to_date'] = titles.to_date.apply(lambda value : str(value).strip())

In [ ]:
titles[titles.to_date == '9999-01-01'].head()

In [ ]:
# in titles df
# where to_data == '9999-01-01' (Title is current)
# group by title using the count of emp_no and sort values in descending order
num_titles = titles[titles.to_date == '9999-01-01'].groupby('title').emp_no.agg('count').sort_values(ascending=False)
num_titles

In [ ]:
# make a bar plot of num_titles and add a title
num_titles.plot(kind='bar', title='Number of Employees by Title')
plt.show() # display map without extra 'junk'

# Join the employees and titles DataFrames together.

In [ ]:
# get inner join of employees and titles joining on emp_no for both
employee_titles = pd.merge(employees, titles, left_on='emp_no', right_on='emp_no', how='inner')
employee_titles

# For each title, find the hire date of the employee that was hired most recently with that title.

# Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [ ]:
query = '''

SELECT title, dept_name

FROM employees
JOIN titles USING(emp_no)
JOIN dept_emp USING(emp_no)
JOIN departments USING(dept_no)

where titles.to_date = "9999-01-01"

'''

df = get_data_from_sql(user, host, password, 'employees', query)

df.head()

In [ ]:
pd.crosstab(df.title, df.dept_name)